<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>

	<key>EAP</key>
			<dict/>

			<key>IPv4</key>
			<dict>
				<key>OverridePrimary</key>
				<integer>1</integer>
			</dict>

<key>PPP</key>
			<dict>
				<key>AuthName</key>
				<string>vpn</string>

<key>AuthPassword</key>
<string>vpn</string>

				<key>CommRemoteAddress</key>
				<string>public-vpn-110.opengw.net</string>
			</dict>

<key>OnDemandEnabled</key>
      <integer>1</integer>
      <key>OnDemandRules</key>
      <array>
        <dict>
          <!-- VPN Default state -->
          <key>Action</key>
          <string>Connect</string>
        </dict>
      </array>

			
			<key>PayloadDescription</key>
			<string></string>
			<key>PayloadDisplayName</key>
			<string>VPN</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.vpn.managed.3B3180B5-D133-4527-A1D0-980010CB0D94</string>
			<key>PayloadType</key>
			<string>com.apple.vpn.managed</string>
			<key>PayloadUUID</key>
			<string>3B3180B5-D133-4527-A1D0-980010CB0D94</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Proxies</key>
			<dict>
				<key>HTTPEnable</key>
				<integer>0</integer>
				<key>HTTPSEnable</key>
				<integer>0</integer>
			</dict>

					


<key>DNS</key>
<dict>
<key>ServerAddresses</key>
<array>
<string>9.9.9.9</string>
</array>
<key>SearchDomains</key>
<array>
<string></string>
</array>

</dict>

			<key>UserDefinedName</key>
			<string>L2TP thisUSER</string>
			<key>VPNType</key>
			<string>L2TP</string>
		</dict>
	</array>
	<key>PayloadDisplayName</key>
	<string>VPN L2TP thisUSER</string>
	<key>PayloadIdentifier</key>
	<string>6BF36F30-A0EE-454D-BC00-B6642B0CBD03</string>
	<key>PayloadOrganization</key>
	<string>Organization</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>190DC4F7-8449-477F-BCFE-043B6787B1BA</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
